artillery_tests/get_reviews_1000.yml
config:
  target: "http://localhost:1000"
  http:
    timeout: 30
  phases:
    - duration: 10
      arrivalRate: 5
      name: warm up
    - duration: 10
      arrivalRate: 5
      rampTo: 100
      name: Ramp up load
    - duration: 20
      arrivalRate: 1000
      name: Sustained load
  payload:
    path: "../../SDC-application-data/product.csv"
    fields:
      - "id"

scenarios:
  - name: "search"
    flow:
      - get:
          url: "/reviews?product_id={{$randomNumber(900000, 1000000}}"